# StructuralSectionIshapeBoltSpacingBetweenRows Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..StructuralSectionIshapeBoltSpacingBetweenRows Property
ParameterTypeId Class See Also
---
"Bolt Spacing between Rows"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId StructuralSectionIshapeBoltSpacingBetweenRows { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property StructuralSectionIshapeBoltSpacingBetweenRows As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ StructuralSectionIshapeBoltSpacingBetweenRows {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace